# Lesson 5 Class Exercises: Tidy Data

With these class exercises we learn a few new things.  When new knowledge is introduced you'll see the icon shown on the right: 
<span style="float:right; margin-left:10px; clear:both;">![Task](https://github.com/spficklin/Data-Analytics-With-Python/blob/master/media/new_knowledge.png?raw=true)</span>

## Tidy Summary:
### Rules for Tidy data
+ Each variable forms a unique column in the data frame.
+ Each observation forms a row in the data frame.
+ Each **type** of observational unit needs its own table.

### Spotting messy data
1. Column headers are values, not variable names.
2. Multiple variables are stored in one column.
3. Variables are stored in both rows and columns.
4. Multiple types of observational units are stored in the same table.
5. A single observational unit is stored in multiple tables.

## Get Started
Import the Numpy and Pandas packages

In [1]:
import numpy as np
import pandas as pd

## Exercise 1:  Review of Tidy Practice
### Task 1: Task 3b from the Practice Notebook
Download the [PI_DataSet.txt](https://hivdb.stanford.edu/download/GenoPhenoDatasets/PI_DataSet.txt) file from [HIV Drug Resistance Database](https://hivdb.stanford.edu/pages/genopheno.dataset.html). Store the file in the same directory as the practice notebook for this assignment.

Here is the meaning of data columns:
- SeqID:  a numeric identifier for a unique HIV isolate protease sequence.  Note: disruption of the protease inhibits HIV’s ability to reproduce.
- The Next 8 columns are identifiers for unique protease inhibitor class drugs.  
  - The values in these columns are the fold resistance over wild type (the HIV strain susceptible to all drugs).
  - Fold change is the ratio of the drug concentration needed to inhibit the isolate.
- The latter columns, with P as a prefix, are the positions of the amino acids in the protease. 
  - '-' indicates consensus.
  - '.' indicates no sequence.
  - '#' indicates an insertion. 
  - '~' indicates a deletion;.
  - '*' indicates a stop codon
  - a letter indicates one letter Amino Acid substitution. 
  - two and more amino acid codes indicates a mixture. 

Import this dataset into your notebook, view the top few rows of the data and respond to these questions:

In [2]:
hiv = pd.read_csv('https://hivdb.stanford.edu/download/GenoPhenoDatasets/PI_DataSet.txt', sep="\t")
hiv.head()

,SeqID,FPV,ATV,IDV,LPV,NFV,SQV,TPV,DRV,P1,...,P91,P92,P93,P94,P95,P96,P97,P98,P99,CompMutList
0,12861,0.4,NaN,0.5,NaN,7.1,0.5,NaN,NaN,-,...,-,-,-,-,-,-,-,-,-,"D30N, R57G, N88D"
1,12862,0.8,NaN,1.2,NaN,24.7,0.9,NaN,NaN,-,...,-,-,-,-,-,-,-,-,-,"D30N, M46I, R57G, L63P, N88D"
2,12863,3.0,NaN,2.8,NaN,2.2,1.0,NaN,NaN,-,...,-,-,-,-,-,-,-,-,-,"M46I, R57G, L63P, V82T, I84V"
3,12864,4.4,NaN,3.9,NaN,3.6,1.7,NaN,NaN,-,...,-,-,-,-,-,-,-,-,-,"L10R, M46I, R57G, L63P, V82T, I84V"
4,12865,3.6,NaN,3.6,NaN,6.2,9.0,NaN,NaN,-,...,-,-,-,-,-,-,-,-,-,"L10I, R57G, L63P, A71V, I84V, L90M"

What are the variables?

drug, fold change, position, position variant, mutation names

What are the observations?

1) numeric fold change value, 2) variant at each position, 3) mutation names list

What are the values?

same as observations

What is the observational unit?

protease, amino acid position, mutation names

What makes this dataset untidy?

1. columns names are variables for the protease inhibitors
2. multiple observable units:  a) fold change measurements for each inhibitor/sequence combo; b) amino acid comparision at each position and c) mutant names

### Task 2: Task 3c from the practice notebook

Use the data retreived from task 3b, generate a data frame containing a Tidy’ed set of values for drug concentration fold change. Be sure to:

- Remove the all columns but the SeqID and the protease inhibitors.
- Tidy the data and set the column names as ‘SeqID’, ‘Drug’ and ‘Fold_change’.
- Order the data frame first by sequence ID and then by Drug name
- Reset the row indexes
- Display the first 10 elements.

In [3]:
# Keep only the wanted columns
hiv_reduced = hiv[['SeqID', 'FPV','ATV','IDV','LPV','NFV','SQV','TPV','DRV']]
hiv_reduced.head()

   SeqID  FPV  ATV  IDV  LPV   NFV  SQV  TPV  DRV
0  12861  0.4  NaN  0.5  NaN   7.1  0.5  NaN  NaN
1  12862  0.8  NaN  1.2  NaN  24.7  0.9  NaN  NaN
2  12863  3.0  NaN  2.8  NaN   2.2  1.0  NaN  NaN
3  12864  4.4  NaN  3.9  NaN   3.6  1.7  NaN  NaN
4  12865  3.6  NaN  3.6  NaN   6.2  9.0  NaN  NaN

In [4]:
# Melt the data and make sure to set the column names as instructed
hivrm = hiv_reduced.melt(id_vars='SeqID', value_name='Drug', var_name='Fold_Change')
hivrm.head()

   SeqID Fold_Change  Drug
0  12861         FPV   0.4
1  12862         FPV   0.8
2  12863         FPV   3.0
3  12864         FPV   4.4
4  12865         FPV   3.6

In [5]:
# Order the data firt by SeqID then by Drug
hivrm = hivrm.sort_values(['SeqID', 'Drug'])
hivrm.head()

       SeqID Fold_Change  Drug
1596    2996         FPV   2.5
11386   2996         SQV  16.1
5512    2996         IDV  16.3
9428    2996         NFV  38.6
3554    2996         ATV   NaN

In [6]:
# Reset the index and display the first 10 rows
hivrm.reset_index(inplace=True, drop=True)
hivrm.head(10)

   SeqID Fold_Change  Drug
0   2996         FPV   2.5
1   2996         SQV  16.1
2   2996         IDV  16.3
3   2996         NFV  38.6
4   2996         ATV   NaN
5   2996         LPV   NaN
6   2996         TPV   NaN
7   2996         DRV   NaN
8   4387         FPV   0.7
9   4387         IDV   0.8

### Task 3: Tidy everything
In Task 2 above we only tidied up the drug fold change. But, now let's tidy up the rest of the table.
+ The other observable units are the amino acid sequences and the mutation list. Create a separate tidy table for each unit.
+ For the amino acid position variant table be sure to remove the 'P' from the amino acid position and order the rows by SeqID then by position

In [7]:
# There are three ways we can include only the columns we want:
# Method #1
hiv_aa = hiv.loc[:,~hiv.columns.isin(['FPV', 'ATV', 'IDV', 'LPV', 'NFV', 'SQV', 'TPV', 'DRV', 'CompMutList'])]

# Method #1
hiv_aa = hiv.drop(['FPV', 'ATV', 'IDV', 'LPV', 'NFV', 'SQV', 'TPV', 'DRV', 'CompMutList'], axis=1)

# Method #2
hiv_aa = hiv[hiv.columns.difference(['FPV', 'ATV', 'IDV', 'LPV', 'NFV', 'SQV', 'TPV', 'DRV', 'CompMutList'])]

In [8]:
aaseq = hiv.drop(['FPV', 'ATV', 'IDV', 'LPV', 'NFV', 'SQV', 'TPV', 'DRV', 'CompMutList'], axis=1)
aaseq = pd.melt(aaseq, id_vars=['SeqID'], 
                var_name='Position', value_name = 'AADiff')
aaseq.head()

   SeqID Position AADiff
0  12861       P1      -
1  12862       P1      -
2  12863       P1      -
3  12864       P1      -
4  12865       P1      -

In [9]:
aaseq['Position'] = aaseq['Position'].str.replace('P','').astype('int')

In [10]:
aaseq.dtypes

SeqID        int64
Position     int32
AADiff      object
dtype: object

In [11]:
aaseq = aaseq.sort_values(['SeqID','Position'])
aaseq.reset_index(drop=True, inplace=True)
aaseq.head()

   SeqID  Position AADiff
0   2996         1      -
1   2996         2      -
2   2996         3      -
3   2996         4      -
4   2996         5      -

In [12]:
mutnames = hiv[['SeqID','CompMutList']]
mutnames.head()

   SeqID                         CompMutList
0  12861                    D30N, R57G, N88D
1  12862        D30N, M46I, R57G, L63P, N88D
2  12863        M46I, R57G, L63P, V82T, I84V
3  12864  L10R, M46I, R57G, L63P, V82T, I84V
4  12865  L10I, R57G, L63P, A71V, I84V, L90M

## Exercise 2:  More Tidy Practice

Let's revisit the weather data from the Tidy paper which contains the daily weather records for five months in 2010 for the MX17004 weather station in Mexico. Each day of the month has its own column (e.g. d1, d2, d3, etc.).  The example data only provides the first 8 dayRun the following code to get the data into the notebook:
```python
data = [['MX17004',2010,1,'tmax',None,None,None,None,None,None,None,None],
        ['MX17004',2010,1,'tmin',None,None,None,None,None,None,None,None],
        ['MX17004',2010,2,'tmax',None,27.3,24.1,None,None,None,None,None],
        ['MX17004',2010,2,'tmin',None,14.4,14.4,None,None,None,None,None],
        ['MX17004',2010,3,'tmax',None,None,None,None,32.1,None,None,None],
        ['MX17004',2010,3,'tmin',None,None,None,None,14.2,None,None,None],
        ['MX17004',2010,4,'tmax',None,None,None,None,None,None,None,None],
        ['MX17004',2010,4,'tmin',None,None,None,None,None,None,None,None],
        ['MX17004',2010,5,'tmax',None,None,None,None,None,None,None,None],
        ['MX17004',2010,5,'tmin',None,None,None,None,None,None,None,None]]
headers = ['id','year','month','element','d1','d2','d3','d4','d5','d6','d7','d8']
weather = pd.DataFrame(data, columns=headers)
weather
```

In [13]:
data = [['MX17004',2010,1,'tmax',None,None,None,None,None,None,None,None],
        ['MX17004',2010,1,'tmin',None,None,None,None,None,None,None,None],
        ['MX17004',2010,2,'tmax',None,27.3,24.1,None,None,None,None,None],
        ['MX17004',2010,2,'tmin',None,14.4,14.4,None,None,None,None,None],
        ['MX17004',2010,3,'tmax',None,None,None,None,32.1,None,None,None],
        ['MX17004',2010,3,'tmin',None,None,None,None,14.2,None,None,None],
        ['MX17004',2010,4,'tmax',None,None,None,None,None,None,None,None],
        ['MX17004',2010,4,'tmin',None,None,None,None,None,None,None,None],
        ['MX17004',2010,5,'tmax',None,None,None,None,None,None,None,None],
        ['MX17004',2010,5,'tmin',None,None,None,None,None,None,None,None]]
headers = ['id','year','month','element','d1','d2','d3','d4','d5','d6','d7','d8']
weather = pd.DataFrame(data, columns=headers)
weather

,id,year,month,element,d1,d2,d3,d4,d5,d6,d7,d8
0,MX17004,2010,1,tmax,None,NaN,NaN,None,NaN,None,None,None
1,MX17004,2010,1,tmin,None,NaN,NaN,None,NaN,None,None,None
2,MX17004,2010,2,tmax,None,27.3,24.1,None,NaN,None,None,None
3,MX17004,2010,2,tmin,None,14.4,14.4,None,NaN,None,None,None
4,MX17004,2010,3,tmax,None,NaN,NaN,None,32.1,None,None,None
5,MX17004,2010,3,tmin,None,NaN,NaN,None,14.2,None,None,None
6,MX17004,2010,4,tmax,None,NaN,NaN,None,NaN,None,None,None
7,MX17004,2010,4,tmin,None,NaN,NaN,None,NaN,None,None,None
8,MX17004,2010,5,tmax,None,NaN,NaN,None,NaN,None,None,None
9,MX17004,2010,5,tmin,None,NaN,NaN,None,NaN,None,None,None

What makes this dataset untidy?

1. The variable day of the month is in the column header.  
2. The max and min temperature variables are in the rows but should be column headers.

The solution for how to tidy this data is in the notebook from Lesson 5. However, we're going to try a slightly different approach. It uses the same steps but in a different order.

First melt the data appropriately to get the day as its own column.  Name the melted dataframe `weather_melted`. Remove the `d` from the beginning of the day and convert it to an integer. Print the first 5 rows:

In [14]:
weather_melted = pd.melt(weather, id_vars=['id', 'year', 'month', 'element'], var_name='day', value_name='temperature')
weather_melted['day'] = weather_melted['day'].str.replace('d', '').astype('int')
weather_melted.head()

        id  year  month element  day temperature
0  MX17004  2010      1    tmax    1        None
1  MX17004  2010      1    tmin    1        None
2  MX17004  2010      2    tmax    1        None
3  MX17004  2010      2    tmin    1        None
4  MX17004  2010      3    tmax    1        None

Now that we have the day melted, next, pivot so that we have two variables tmax and tmin as their own columns. Name the resulting dataframe `weather_pivoted`.  Print the top few rows.

In [15]:
weather_melted['temperature'] = weather_melted['temperature'].astype('float')
weather_pivoted = pd.pivot_table(weather_melted, index=['id', 'year', 'month', 'day'], columns='element', values=['temperature'])
weather_pivoted.head()

                       temperature
element                       tmax  tmin
id      year month day
MX17004 2010 2     2          27.3  14.4
                   3          24.1  14.4
             3     5          32.1  14.2

Notice that we mave multi-level indexing. Reduce this to a typical one-level index using the `reset_index` function.

In [16]:
weather_pivoted.reset_index(inplace=True)
weather_pivoted.head()

              id  year month day temperature
element                                 tmax  tmin
0        MX17004  2010     2   2        27.3  14.4
1        MX17004  2010     2   3        24.1  14.4
2        MX17004  2010     3   5        32.1  14.2

Notice, however, we still have MultiIndexing on the column.  We can remove this by simply resetting the column names.

In [17]:
weather_pivoted.columns = ['id', 'year', 'month', 'day', 'tmax', 'tmin']
weather_pivoted.head()

        id  year  month  day  tmax  tmin
0  MX17004  2010      2    2  27.3  14.4
1  MX17004  2010      2    3  24.1  14.4
2  MX17004  2010      3    5  32.1  14.2

<span style="float:right; margin-left:10px; clear:both;">![Task](https://github.com/spficklin/Data-Analytics-With-Python/blob/master/media/new_knowledge.png?raw=true)</span>

Finally, let's convert the year, month and day to a datetime object.  Previously, when we wanted to convert the date in a string to a `datetime` object we used the `pd.to_datetime` function. However, our date is spread across three different columns and is not a string. In the Tidy Data lesson we did this using the `datatime` package but it was not well explained. Let's look at this deeper.  

The [`datetime` module](https://docs.python.org/3/library/datetime.html) provides a variety of functions for working with dates. The function that will most help us is the `datetime.datetime` function.  See [documentation here](https://docs.python.org/3/library/datetime.html#datetime.datetime).  We can use this function to create the `datetime` objects that we need. But this is a Python module and not a Pandas module.  So, it does not accept a Series.  We must therefore use the `apply` function of the Pandas dataframe. Rememer that the `apply` function takes the name of a function or a function itself! Review the following code.

```python
import datetime

def create_date(row):
    return datetime.datetime(year=row["year"], month=int(row["month"]), day=row["day"])

melted_weather["date"] = melted_weather.apply(lambda row: create_date(row), axis=1)
```

When the `apply` function was first introduced in the [L04-Pandas_Part2.ipynb Lesson](./L04-Pandas_Part2-Practice.ipynb#4.2-Apply) we supplied function names like `print` or `np.sum`. That worked because by default, with `apply`, the function is applied across rows (i.e. down each column).  We need to calculate the date which is across columns. We can provide the `axis=1` argument to `apply` but we only need 3 columns to form a date, and our melted/pivoted dataframe has more than just the 3 date-specific columns in.  

To solve this challenge, we have to create our own function to give to the `apply` function.  In the code above, the `create_date` function provides this functionality. Here, the function receives a Series object we call `row` and inside the function we call the `datetime.datetime` function and pass in the corresponding values from the row that can be used to make the `datetime` object.

In [18]:
import datetime

def create_date(row):
    return datetime.datetime(year=row["year"], month=int(row["month"]), day=row["day"])

weather_pivoted["date"] = weather_pivoted.apply(lambda row: create_date(row), axis=1)
weather_pivoted.head()

        id  year  month  day  tmax  tmin       date
0  MX17004  2010      2    2  27.3  14.4 2010-02-02
1  MX17004  2010      2    3  24.1  14.4 2010-02-03
2  MX17004  2010      3    5  32.1  14.2 2010-03-05

## Exercise 3: More Tidy Practice
Consider the following billboard dataset described in the Tidy paper.  This dataset contains the weekly rank of songs from the moment they enter the Billboard Top 100 to the subsequent 75 weeks.  First load the data. You'll find it in the data directory here:  `../data/billboard.csv`.  Save the data with the name `billboard`. List the top 10 lines:

Do a quick review of the data
+ List the columns.
+ List the data types.
+ Are there missing values?  Should we worry about missing values?
+ Are there duplicates?  Should we worry about any duplcates?
+ What fields are meant to be categorical?  And for those check the categories to make sure there is nothing unexpected there.

What makes this data untidy?

Let's tidy this data into a variable named `billboard_tidy`

Perform the following:
1. Remove columns with missing values
2. convert the week to an actual number
3. Convert the rank column to an integer

Next, calculate the actual date for the rank.  We have the date entered, we just need to add the number of days (in weeks) to the date entered to get the actual date for the rank. We haven't learned all of the date time functions, but here's some hints:

- `pd.to_timedelta`: calculates absolute differences in times, expressed in difference units (e.g. days, hours, minutes, seconds)
- `pd.DateOffset`: